Ran Plan for dir: `.` workspace: `default`

<details><summary>Show Output</summary>

```diff
Executando terraform plan


Note: Objects have changed outside of Terraform

Terraform detected the following changes made outside of Terraform since the
last "terraform apply":

  # aws_autoscaling_attachment.asg_attachment_atlantis has been deleted
- resource "aws_autoscaling_attachment" "asg_attachment_atlantis" {
      - alb_target_group_arn   = "arn:aws:elasticloadbalancing:us-east-2:398963803929:targetgroup/tg-ecs/3efdda83734360cb" -> null
      - autoscaling_group_name = "atlantis_ecs" -> null
      - id                     = "atlantis_ecs-20220318184640466800000001" -> null
    }

  # aws_ecs_cluster.atlantis has changed
~ resource "aws_ecs_cluster" "atlantis" {
      + capacity_providers = []
        id                 = "arn:aws:ecs:us-east-2:398963803929:cluster/atlantis"
        name               = "atlantis"
      + tags               = {}
        # (2 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }


Unless you have made equivalent changes to your configuration, or ignored the
relevant attributes using ignore_changes, the following plan may include
actions to undo or respond to these changes.

─────────────────────────────────────────────────────────────────────────────

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+ create
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # aws_autoscaling_attachment.asg_attachment_atlantis will be created
+ resource "aws_autoscaling_attachment" "asg_attachment_atlantis" {
      + alb_target_group_arn   = "arn:aws:elasticloadbalancing:us-east-2:398963803929:targetgroup/tg-ecs/3efdda83734360cb"
      + autoscaling_group_name = "atlantis_ecs"
      + id                     = (known after apply)
    }

  # aws_launch_configuration.ubuntu must be replaced
-/+ resource "aws_launch_configuration" "ubuntu" {
      ~ arn                              = "arn:aws:autoscaling:us-east-2:398963803929:launchConfiguration:6b7308d9-0bc4-4f8a-8608-4540f957d1c5:launchConfigurationName/atlantis_ecs" -> (known after apply)
      ~ ebs_optimized                    = false -> (known after apply)
      ~ id                               = "atlantis_ecs" -> (known after apply)
      + key_name                         = "SNS" # forces replacement
        name                             = "atlantis_ecs"
      + name_prefix                      = (known after apply)
      - vpc_classic_link_security_groups = [] -> null
        # (6 unchanged attributes hidden)

      + ebs_block_device {
          + delete_on_termination = (known after apply)
          + device_name           = (known after apply)
          + encrypted             = (known after apply)
          + iops                  = (known after apply)
          + no_device             = (known after apply)
          + snapshot_id           = (known after apply)
          + throughput            = (known after apply)
          + volume_size           = (known after apply)
          + volume_type           = (known after apply)
        }

      + metadata_options {
          + http_endpoint               = (known after apply)
          + http_put_response_hop_limit = (known after apply)
          + http_tokens                 = (known after apply)
        }

      + root_block_device {
          + delete_on_termination = (known after apply)
          + encrypted             = (known after apply)
          + iops                  = (known after apply)
          + throughput            = (known after apply)
          + volume_size           = (known after apply)
          + volume_type           = (known after apply)
        }
    }

Plan: 2 to add, 0 to change, 1 to destroy.


```

* :arrow_forward: To **apply** this plan, comment:
    * `atlantis apply -d .`
* :put_litter_in_its_place: To **delete** this plan click [here](http://66992d035d8e:4141/lock?id=Matheus-SCosta%252FATLANTIS-ECS%252F.%252Fdefault)
* :repeat: To **plan** this project again, comment:
    * `atlantis plan -d .`
</details>

**Note: Objects have changed outside of Terraform**
Plan: 2 to add, 0 to change, 1 to destroy.

---
* :fast_forward: To **apply** all unapplied plans from this pull request, comment:
    * `atlantis apply`
* :put_litter_in_its_place: To delete all plans and locks for the PR, comment:
    * `atlantis unlock`
